<?php
    // 3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:

    // Московская область:
    // Москва, Зеленоград, Клин
    // Ленинградская область:
    // Санкт-Петербург, Всеволожск, Павловск, Кронштадт
    // Рязанская область … (названия городов можно найти на maps.yandex.ru)

    $regionAndCitys = [
        'Московская область' => ['Зеленоград', 'Москва', 'Клин'],
        'Ленинградская область' => ['Санкт-Петербург', 'Всеволжск', 'Павловск', 'Кронштадт'],
        'Рязанская область' => ['Рязань', 'Искра', 'Листвянка'],
    ];
    
    foreach($regionAndCitys as $region => $citys) {
        echo $region . ":<br>" . implode(", ", $citys) . ".<br><br>";
    }

?>