<?php
    mb_internal_encoding("UTF-8");
    // 4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).

    // Написать функцию транслитерации строк.

    function translit($str) {

        $translitArray = [
            'а' => 'a',
            'б' => 'b', 
            'в' => 'v',
            'г' => 'g',
            'д' => 'd',
            'е' => 'e',
            'ё' => 'yo',
            'ж' => 'je',
            'з' => 'z',
            'и' => 'i',
            'й' => 'y',
            'к' => 'k',
            'л' => 'l',
            'м' => 'm',
            'н' => 'n',
            'о' => 'o',
            'п' => 'p',
            'р' => 'r',
            'с' => 's',
            'т' => 't',
            'у' => 'u',
            'ф' => 'f',
            'х' => 'h',
            'ц' => 'c',
            'ч' => 'ch',
            'ш' => 'sh',
            'щ' => 'she',
            'ъ' => 'tverdiyznak',
            'ы' => 'ii',
            'ь' => 'magkiyznak',
            'э' => 'e',
            'ю' => 'yu',
            'я' => 'ya',
        ];    

        $x = mb_strtolower($str);
        $x = strtr($x, $translitArray);
        return $x;
    }

    $str = 'ПрУвед медвед';

    echo translit($str);
?>